app/Http/Controllers/Auth/LoginController.php

update `users` set `last_view` = 1610553008, `updated_at` = 1610553008 where `id` = 4
---
    public function afterLogged(Request $request)
    {
        $user = auth()->user();
        $userBlock = userMeta($user->id, 'blockDate');

        if ($user->mode !== 'active') {
            if (!empty($userBlock)) {
                if ($userBlock < time()) {
                    $user->mode = 'active';
                } else {
                    auth()->logout();
                    $blockDate = date('d F Y', $userBlock);
                    return redirect()->back()->with('msg', trans('main.access_denied') . $blockDate);
                }
            } else {
                auth()->logout();
                return redirect()->back()->with('msg', trans('main.in_active_account_alert'));
            }
        }

        $user->last_view = time();
        $user->updated_at = time();