app/Helper/helper.php

function get_option($option, $default = null)
{
    $cacheKey = 'get.' . $option;
    $result = cache()->remember($cacheKey, 24 * 60 * 60, function () use ($option) {
        return \App\Models\Option::where('option', $option)->value('value');
    });
---
select `value` from `option` where `option` = 'main_page_blog_post_count' limit 1

function getTemplate()
{
    $template = cache()->remember('view.template', 7 * 24 * 60 * 60, function () {
        return \App\Models\ViewTemplate::where('status', true)->first();
    });
---
select * from `view_templates` where `status` = 1 limit 1