app/Http/Controllers/UserController.php

select * from `notification` where (`recipent_type` = 'all') or (`recipent_type` = 'category' and `recipent_list` = 2) or (`recipent_type` = 'user' and `recipent_list` = 4) order by `id` desc limit 8
select * from `sells` where `mode` = 'pay' and `buyer_id` = 4 order by `id` desc limit 5
select count(*) as aggregate from `sells` where `mode` = 'pay' and `buyer_id` = 4 and `buyer_id` = 4 limit 5
select * from `sells` where `mode` = 'pay' and `buyer_id` = 4 and `buyer_id` = 4 and `user_id` = 4 order by `id` desc limit 5
---
    public function dashboard()
    {
        $user = (auth()->check()) ? auth()->user() : false;
        if (!$user) {
            return redirect('/login');
        }

        $userNotification = Notification::where(function ($q) {
            $q->where('recipent_type', 'all');
        })->orWhere(function ($q) use ($user) {
            $q->where('recipent_type', 'category')->where('recipent_list', $user->category_id);
        })->orWhere(function ($q) use ($user) {
            $q->where('recipent_type', 'user')->where('recipent_list', $user->id);
        })->limit(8)
            ->orderBy('id', 'DESC')
            ->get();

        $sellQuery = Sell::where('mode', 'pay');

        $userBuy = $sellQuery->where('buyer_id', $user->id)
            ->with('content')
            ->orderBy('id', 'DESC')
            ->take(5)
            ->get();


        $userBuyCount = $sellQuery->where('buyer_id', $user->id)->count();

        $userSell = $sellQuery->where('user_id', $user->id)
            ->with(['content' => function ($q) {
                $q->with('metas');
            }])
            ->get();

select sum(`price`) as aggregate from `transaction` where `user_id` = 4 and `mode` = 'deliver'
---

        $sell_rate = UserRate::where('mode', 'sellcount')->orderBy('id')->get();

        $total_icome = Transaction::where('user_id', $user->id)->where('mode', 'deliver')->sum('price');

select count(*) as aggregate from `sells` where `user_id` = 4 and `mode` = 'pay' and `created_at` > 1608837610 and `created_at` < 1608924010
select sum(`income`) as aggregate from `transaction` where `user_id` = 4 and `mode` = 'deliver' and `created_at` > 1608837610 and `created_at` < 1608924010
---
            $timestamp = strtotime('-' . $i . ' day') + 12600;
            $tenDay[$i] = (date('m/d', $timestamp));

            $sellDay[$i] = Sell::where('user_id', $user->id)
                ->where('mode', 'pay')
                ->where('created_at', '>', $timestamp)
                ->where('created_at', '<', $timestamp + 86400)
                ->count();

            $incomeDay[$i] = Transaction::where('user_id', $user->id)
                ->where('mode', 'deliver')
                ->where('created_at', '>', $timestamp)
                ->where('created_at', '<', $timestamp + 86400)
                ->sum('income');

select * from `tickets` where `user_id` = 100004 or 0 = 1 order by `id` desc
select `ticket_id` from `tickets_user` where `user_id` = 100004
---
    public function tickets()
    {
        $user = auth()->user();
        $ticket_invite = TicketsUser::where('user_id', $user->id)->pluck('ticket_id');
        $tickets = Tickets::with('category', 'messages')->orderBy('id', 'DESC')->where('user_id', $user->id)->orWhereIn('id', $ticket_invite->toArray())->get();

update `sells` set `view` = 1 where `user_id` = 100004 and `type` = 'download'
select * from `sells` where `user_id` = 100004 order by `id` desc limit 20
select count(*) as aggregate from `sells` where `user_id` = 100004
---
    public function sellDownload(Request $request)
    {
        $user = auth()->user();
        $sellList = Sell::with(['buyer', 'content.metas', 'transaction', 'rate'])->where('user_id', $user->id)->orderBy('id', 'DESC');
        $count = $sellList->count();
        if ($request->get('p') != null)
            $sellList->skip($request->get('p') * 20);
        $sellList->take(20);

        ## Update Notifications
        Sell::where('user_id', $user->id)->where('type', 'download')->update(['view' => 1]);

        return view(getTemplate() . '.user.sell.download', ['lists' => $sellList->get(), 'count' => $count]);