app/Http/Controllers/WebController.php

select * from `contents` where `mode` = 'publish' order by `id` desc limit 10
select * from `users` where `users`.`id` in (108, 109, 110, 111, 112, 113, 114, 115, 116, 117)
---
    private function getContents($tag, $orderByName, $orderByValue, $withCount = null, $limit = 10)
    {
        $query = Content::where('mode', 'publish')
            ->orderBy($orderByName, $orderByValue)
            ->limit($limit)
            ->with('metas', 'user');

        if (!empty($withCount)) {
            $query->withCount($withCount);
        }

        return $query->get();

select * from `article` where `mode` = 'publish' order by `id` desc limit 4
---
    private function getArticlePosts()
    {
        return Article::where('mode', 'publish')
            ->orderBy('id', 'DESC')
            ->limit(get_option('main_page_article_post_count', 1))
            ->get();

select `users`.*, (select count(*) from `contents` where `users`.`id` = `contents`.`user_id` and `mode` = 'publish') as `contents_count` from `users` where `mode` = 'active' and `admin` = '0' order by `contents_count` desc limit 4
---
    private function getUsersMostContent()
    {
        $userQuery = $this->getUserQuery();
        return $userQuery->withCount(['contents' => function ($query) {
            $query->where('mode', 'publish');
        }])
            ->with(['usermetas'])
            ->orderBy('contents_count', 'DESC')
            ->limit(4)
            ->get();

select * from `user_channel` where `mode` = 'active' order by `id` desc limit 4
select * from `user_channel` where `mode` = 'active' order by `id` desc, `view` desc limit 4
select `users`.*, (select count(*) from `follow` where `users`.`id` = `follow`.`user_id`) as `follow_count` from `users` where `users`.`id` in (109, 111, 112, 117)
---
    private function getChannels()
    {
        $channelsQuery = Channel::where('mode', 'active');

        $channels['new'] = $channelsQuery->orderBy('id', 'DESC')
            ->limit(4)
            ->get();


        $channels['view'] = $channelsQuery->orderBy('view', 'DESC')
            ->limit(4)
            ->get();


        $channels['popular'] = $channelsQuery->with(['user' => function ($query) {
            $query->withCount(['follow']);
        }])
            ->get()
            ->sortByDesc('user.followCount');